app/controllers/images_controller.rb

INSERT INTO "images" ("avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @image = Image.new(image_params)

    if @image.save