app/controllers/kosts_controller.rb

SELECT  "penggunas".* FROM "penggunas" WHERE "penggunas"."id" = $1 ORDER BY "penggunas"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "kosts".* FROM "kosts" WHERE "pengguna"."id" = $1  [["id", 3]]
---
	def index
		@pengguna = Pengguna.find(current_pengguna.id)
		@kosts = Kost.where(pengguna: current_pengguna.id)

SELECT "kosts".* FROM "kosts" WHERE (kosts.alamat LIKE alamat('%', 'new york', '%'))
SELECT "kosts".* FROM "kosts"
---
	def detail
		if params[:search]
			@kosts = Kost.where("kosts.alamat LIKE concat('%', ?, '%')", params[:search])
		else
			@kosts = Kost.all

SELECT  "kosts".* FROM "kosts" WHERE "kosts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def show
		@kost = Kost.find(params[:id])

SELECT  "penggunas".* FROM "penggunas" WHERE "penggunas"."id" = $1 ORDER BY "penggunas"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
	def inbox
		@pengguna = Pengguna.find(current_pengguna.id)

SELECT  "penggunas".* FROM "penggunas" WHERE "penggunas"."id" = $1 ORDER BY "penggunas"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
	def outbox
		@pengguna = Pengguna.find(current_pengguna.id)

SELECT  "penggunas".* FROM "penggunas" WHERE "penggunas"."id" = $1 ORDER BY "penggunas"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def new
		@pengguna = Pengguna.find(current_pengguna.id)

SELECT  "penggunas".* FROM "penggunas" WHERE "penggunas"."id" = $1 ORDER BY "penggunas"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "kosts" ("nama_kos", "harga_kos", "fasilitas", "alamat", "keterangan_lain", "created_at", "updated_at", "pengguna_id", "kost_img_file_name", "kost_img_content_type", "kost_img_file_size", "kost_img_updated_at", "kost_img2_file_name", "kost_img2_content_type", "kost_img2_file_size", "kost_img2_updated_at", "kost_img3_file_name", "kost_img3_content_type", "kost_img3_file_size", "kost_img3_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
	def create
		@pengguna = Pengguna.find(current_pengguna.id)
		@kost = Kost.new(resource_params)
		if @kost.save

SELECT  "kosts".* FROM "kosts" WHERE "kosts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def edit
		@kost = Kost.find(params[:id])

SELECT  "kosts".* FROM "kosts" WHERE "kosts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "kosts" SET "nama_kos" = $1, "fasilitas" = $2, "alamat" = $3, "updated_at" = $4 WHERE "kosts"."id" = $5  [["nama_kos", "Kosan Putri"], ["fasilitas", "ac"], ["alamat", "cipadung"], ["updated_at", "2017-12-03 09:39:10.803361"], ["id", 3]]
---
	def update
		@kost = Kost.find(params[:id])
		@kost.update(resource_params)

SELECT  "kosts".* FROM "kosts" WHERE "kosts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "kosts" WHERE "kosts"."id" = $1  [["id", 8]]
---
	def destroy
		kost = Kost.find(params[:id])
		kost.destroy

SELECT  "kosts".* FROM "kosts" WHERE "kosts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
	def set_kost
		@kost = Kost.find(params[:id])