app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."pengguna_id" = 4
---
  def index
    @messages = Message.where(pengguna: current_pengguna.id)

INSERT INTO "messages" ("pesan", "receiver", "created_at", "updated_at", "pengguna_id", "kost_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["pesan", "asdsadas"], ["receiver", "4"], ["created_at", "2017-12-29 19:13:54.586512"], ["updated_at", "2017-12-29 19:13:54.586512"], ["pengguna_id", 4], ["kost_id", 8]]
---
  def create
    @message = Message.new(message_params)
    if @message.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 37]]
---
  def destroy
		message = Message.find(params[:id])
		message.destroy

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_mes
    @message = Message.find(params[:id])